// LR2: Integer13, Boolean8, Math37
// Усі три завдання виконані в одному консольному застосунку.
// Мова: C++17

#include <iostream>
#include <cmath>     // sin, cos, sqrt, log2, fabs, pow
#include <limits>    // std::numeric_limits
using namespace std;

int main() {
    cout << "===== Лабораторна робота №2 =====\n";
    cout << "Завдання: Integer13, Boolean8, Math37\n\n";

    // -------------------------------
    // 1) Integer13
    // Дано тризначне число n. Закреслили першу зліва цифру і приписали її справа.
    // Тобто циклічний зсув вліво: abc -> bca.
    // Формула: res = (n % 100) * 10 + (n / 100);
    // -------------------------------
    cout << "Завдання 1. Integer13\n";
    int n;
    cout << "Введiть тризначне число n (100..999): ";
    cin >> n;

    if (n < 100 || n > 999) {
        cout << "Помилка: n повинно бути тризначним додатним числом.\n\n";
    } else {
        int res_int13 = (n % 100) * 10 + (n / 100);
        cout << "Результат (пiсля перенесення першої цифри в кiнець): "
             << res_int13 << "\n\n";
    }

    // -------------------------------
    // 2) Boolean8
    // Дано цiлi A, B. Перевiрити висловлювання: «Кожне з чисел A i B непарне».
    // У C++ істинність виводимо як true/false (boolalpha).
    // -------------------------------
    cout << "Завдання 2. Boolean8\n";
    int A, B;
    cout << "Введiть A i B (цiлi): ";
    cin >> A >> B;

    bool bothOdd = (A % 2 != 0) && (B % 2 != 0);
    cout << boolalpha; // виводимо true/false замість 1/0
    cout << "Кожне з чисел A i B непарне: " << bothOdd << "\n\n";

    // -------------------------------
    // 3) Math37
    // Формула з табл. 3 (№37):
    //              3 * log2(|x|) * |x|^3 * sqrt( | x^2 * sin^2(x) * cos^3(x) | )
    // y(x) = -------------------------------------------------------------------
    //                      cos(x) + (1/2) * sqrt(x + 5)
    //
    // Зауваження щодо областi визначення:
    //   - log2(|x|) визначено, якщо |x| > 0  (тобто x != 0)
    //   - sqrt(x + 5) вимагає x >= -5
    //   - знаменник не повинен дорiвнювати нулю
    // Кут x у радіанах (як прийнято в cmath).
    // -------------------------------
    cout << "Завдання 3. Math37\n";
    double x;
    cout << "Введiть дiйсне x: ";
    cin >> x;

    // Перевiрки коректностi
    if (x == 0.0) {
        cout << "Помилка: log2(|x|) не iснує при x = 0.\n";
    } else if (x < -5.0) {
        cout << "Помилка: пiдкореневий вираз sqrt(x+5) вiд'ємний (x >= -5).\n";
    } else {
        double denom = cos(x) + 0.5 * sqrt(x + 5.0);
        if (denom == 0.0) {
            cout << "Помилка: знаменник дорiвнює нулю.\n";
        } else {
            // чисельник
            double num = 3.0 * log2(fabs(x))
                       * pow(fabs(x), 3.0)
                       * sqrt( fabs( (x * x) * pow(sin(x), 2.0) * pow(cos(x), 3.0) ) );
            double y = num / denom;
            cout << "y = " << y << "\n";
        }
    }

    cout << "\n===== Готово =====\n";
    return 0;
}
